# macOS packages via Homebrew
# Note: Favour Homebrew over Cargo when versions are equal

tap "opencode-ai/tap"
brew "bat"
brew "cmake"
brew "cocoapods"
brew "codex"
brew "coreutils"
brew "defaultbrowser"
brew "direnv"
brew "docker"
brew "dprint"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-secrets"
brew "gitleaks"
brew "glow"
brew "httpie"
brew "huggingface-cli"
brew "llm"
brew "python@3.12"
brew "ncdu"
brew "utf8proc"
brew "neovim"
brew "node"
brew "openai-whisper"
brew "pandoc"
brew "pipx"
brew "pkgconf"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "yazi"
brew "zellij"
brew "zola"
brew "zoxide"
brew "opencode-ai/tap/opencode"
cask "alacritty"
cask "devtoys"
cask "maccy"
cask "xquartz"
