[
  "obsidian-git",
  "obsidian-excalidraw-plugin",
  "table-editor-obsidian",
  "quick-latex",
  "omnisearch",
  "better-word-count",
  "obsidian-zotero-desktop-connector",
  "templater-obsidian",
  "dataview",
  "obsidian-kanban",
  "obsidian-full-calendar",
  "obsidian-advanced-slides",
  "obsidian-plantuml",
  "obsidian-spaced-repetition",
  "code-emitter",
  "obsidian-leaflet-plugin",
  "sheet-plus",
  "obsidian-style-settings",
  "edge-tts",
  "digitalgarden",
  "obsidian-book-search-plugin",
  "edit-in-neovim",
  "vim-toggle",
  "mcp-tools",
  "obsidian-local-rest-api",
  "slash-snippets",
  "obsidian-day-planner",
  "tag-wrangler"
]
